#include<iostream>
#include<string.h>
#include"zsgc.h"
using namespace std;
void showMenu()
{
	cout << "|---------------------------------------|" << endl;
	 cout << "|--------欢迎进入学生信息管理系统--------|" << endl;
	 cout << "|------------------------------------------|" << endl;
	cout << "|------------ 1、添加学生信息 ------------|" << endl;
	cout << "|------------ 2、显示学生信息 ------------|" << endl;
	cout << "|------------ 3、删除学生信息 ------------|" << endl;
	cout << "|------------ 4、查找学生信息 ------------|" << endl;
	cout << "|------------ 5、修改学生信息 ------------|" << endl;
	cout << "|------------ 6、清空学生信息 ------------|" << endl;
	cout << "|------------ 0、退出学生信息 ------------|" << endl;
	cout << "|---------------------------------------|" << endl;
	cout << "|---------------------------------------|" << endl;
}

